package main

// Задача 2. Сумма через канал
// Дан слайс []int{N}. Запусти горутину, которая считает сумму и отправляет в канал. main получает результат и печатает.

// Тренирует: возврат результата через канал.
// Подсказка: без close — одно значение.

func SumInCh(nums []int) <-chan int {
	//Создаем канал, который будем возвращать
	out := make(chan int)
	//В горутине считаем сумму слайса
	go func() {
		defer close(out)
		sum := 0
		for _, val := range nums {
			sum += val
		}
		//записываем сумму в канал
		out <- sum
	}()
	//Возвращаем канал
	return out
}